## Nominal /OHE

In [2]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [3]:
df = pd.DataFrame({'color':['red','blue','green','green','red','blue']})

In [4]:
df

   color
0    red
1   blue
2  green
3  green
4    red
5   blue

In [5]:
## create on instance of One hot encoder
encoder = OneHotEncoder()

In [10]:
# fit the encoder to the dataframe and transform the categrocial variable
encoded=encoder.fit_transform(df[['color']])

In [13]:
encoded_df=pd.DataFrame(encoded.toarray(), columns=encoder.get_feature_names_out() )

In [14]:
encoded_df

   color_blue  color_green  color_red
0         0.0          0.0        1.0
1         1.0          0.0        0.0
2         0.0          1.0        0.0
3         0.0          1.0        0.0
4         0.0          0.0        1.0
5         1.0          0.0        0.0

In [18]:
pd.concat([df,encoded_df],axis=1)

   color  color_blue  color_green  color_red
0    red         0.0          0.0        1.0
1   blue         1.0          0.0        0.0
2  green         0.0          1.0        0.0
3  green         0.0          1.0        0.0
4    red         0.0          0.0        1.0
5   blue         1.0          0.0        0.0

## Label and Ordinal Encoding

In [20]:
import pandas as pd

In [21]:
from sklearn.preprocessing import LabelEncoder

In [22]:
df = pd.DataFrame({'color':['red','blue','green','green','red','blue']})

In [23]:
df

   color
0    red
1   blue
2  green
3  green
4    red
5   blue

In [28]:
## create and instance of label encoder
encoder=LabelEncoder()

In [30]:
encoder.fit_transform(df['color'])

array([2, 0, 1, 1, 2, 0])

In [31]:
## ordinal encoder 
import pandas as pd
from sklearn.preprocessing import OrdinalEncoder
df= pd.DataFrame({'size':['small','medium','large','medium','small','large']})

In [32]:
df

     size
0   small
1  medium
2   large
3  medium
4   small
5   large

In [33]:
## Create and instance and ordinl class
encoder=OrdinalEncoder(categories=[['small','medium','large']])

In [35]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

## Target Guided Ordinal Encoding

In [36]:
import pandas as pd
df=pd.DataFrame({'city':['New york','london','delhi','noida','New york','delhi'],
                'price':[200,150,300,350,180,320]})

In [37]:
df

       city  price
0  New york    200
1    london    150
2     delhi    300
3     noida    350
4  New york    180
5     delhi    320

In [39]:
## calculate the mean
df.groupby('city')['price'].mean()

city
New york    190.0
delhi       310.0
london      150.0
noida       350.0
Name: price, dtype: float64

In [42]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [43]:
## replace each city with mean price
df['city_encoded']=df['city'].map(mean_price)

In [44]:
df

       city  price  city_encoded
0  New york    200         190.0
1    london    150         150.0
2     delhi    300         310.0
3     noida    350         350.0
4  New york    180         190.0
5     delhi    320         310.0

In [45]:
import seaborn as sns

In [46]:
sns.load_dataset('tips')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]